<template>
  <div id="section2" class="container">
    <div class="mt-100"></div>
    <div class="row">
      <img class="img" src="../assets/rIhFX-UENas.jpg" alt="">
      <div class="title--activiti col-6">
        <h1>
          О нас
          <hr />
        </h1>
        <h2>Предприятие штамповка РФ это:</h2>
        <p>
          2.5 тысяч тонн выпускаемой продукции ежегодно. Ручная,
          полуавтоматическая, автоматическая и прогрессивная штамповка. Расчёт и
          экономическое обоснование предлагаемых моделей производства.
          Сопутствующие услуги по покрытиям, сборке, фасовке и комплектации
          продукции. Проектирование и реверс-инжиниринг силами собственного
          конструкторского бюро.
          <br />
          3 шага до начала производства: Направление чертежа\образца продукции
          Согласование требуемых характеристик готового продукта Заключение
          договора и старт производства
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";

const currentCard = ref({
  title: "Космическая отрасль",
  smallDesc: "",
  txt: "Наша компания специализируется на предоставлении услуг для компаний, разрабатывающих продукцию в аэрокосмической отрасли. Мы предлагаем широкий выбор технологий производства и вариантов материалов, чтобы удовлетворить самые требовательные потребности наших клиентов.",
  color: "#1379fe5e",
});

const cards = [
  {
    title: "Космическая отрасль",
    smallDesc:
      "Мы предлагаем широкий выбор технологий производства для аэрокосмической отрасли...",
    txt: "Наша компания специализируется на предоставлении услуг для компаний, разрабатывающих продукцию в аэрокосмической отрасли. Мы предлагаем широкий выбор технологий производства и вариантов материалов, чтобы удовлетворить самые требовательные потребности наших клиентов.",
    color: "#1379fe5e",
  },
  {
    title: "Автомобильная промышленность",
    smallDesc:
      "Штамповка.РФ помогает эффективно закупать детали для автомобильной промышленности...",
    txt: "Штамповка.РФ — ваш надежный партнер в закупке нестандартных деталей для автомобильной промышленности. Мы предоставляем комплексный сервис для различных производственных процессов, чтобы обеспечить эффективность и качество вашей продукции.",
    color: "#feee135e",
  },
  {
    title: "Электроника и энергетика",
    smallDesc:
      "Мы оптимизируем цепочки поставок для энергетических компаний и ускоряем разработку критически важных компонентов...",
    txt: "Мы помогаем энергетическим компаниям оптимизировать свои цепочки поставок и ускорить разработку критически важных компонентов. Это сокращает время выполнения заказов и способствует созданию более гибкой и оперативно реагирующей производственной экосистемы.",
    color: "#fe4a135e",
  },
  {
    title: "Медицинское оборудование",
    smallDesc:
      "Наш опыт в цифровом производстве помогает компаниям в медицинской промышленности...",
    txt: "Наш широкий спектр производственных технологий и вариантов биосовместимых материалов способствует предоставлению опыта цифрового производства компаниям, разрабатывающим продукцию в медицинской промышленности",
    color: "#56fe135e",
  },
];
</script>

<style lang="scss" scoped>
@import "../fluid.sass";
.title--activiti {
  display: flex;
  flex-direction: column;
  justify-content: center;
  text-align: left;
  @include fluid("height", 200);
  @include fluid("font-size", 16);
  @include fluid("margin-top", 100);
  @include fluid("margin-left", 100);
  h1 {
    @include fluid("font-size", 40);
  }
  h2{
    @include fluid("font-size", 30);
  }
  p{
    @include fluid("font-size", 20);
  }
}
.img{
  box-shadow: -350px -100px 0  0 #b5cbd4;
}
@media (max-width: 991px) {
  .title--activiti {
    flex-direction: column;
    @include fluid("gap", 20);
    h1 {
      @include fluid("font-size", 39);
    }
    p {
      @include fluid("font-size", 26);
    }
  }
}
</style>
