<template>
  <div id="section2" class="container">
    <div class="mt-100"></div>
    <div class="row wrap-content--activiti">
      <img class="img col-6" src="../assets/rIhFX-UENas.jpg" alt="" />
      <div class="title--activiti col-6">
        <h1>
          О нас
          <hr />
        </h1>
        <h2>Предприятие штамповка РФ это:</h2>
        <p>
          современное динамично развивающееся предприятие, которое неотрывно
          держит руку на пульсе научно-технического прогресса.  Мы используем в
          своей работе:
        </p>
        <ul>
          <li>Новейшее металлообрабатывающее оборудование с числовым программным управлением, в том числе прецизионный комплекс объёмной штамповки</li>
          <li>Лицензионное программное обеспечение производственного контроля, управления проектами, 3D-моделирования</li>
          <li>Современные средства проверки качества изделий</li>
          <li>Гибкую ценовую политику — отпускная цена изделий зависит от размера партии, сложности обработки, стажа сотрудничества с клиентом и других параметров</li>
          <li>Новейшие методики логистики и управления ресурсами предприятия.</li>
        </ul>
        <p>  
          3Офис и производство компании ШТАМПОВКА.РФ находятся в
          Санкт-Петербурге и мы отгружаем заказысо всей России, а также из стран
          ближнего зарубежья. Наша команда — сплочённый дружный коллектив, где
          каждый на своём месте.
          <br /><br />
          Мы готовы к решению задач любой сложности, в чём нам в равной мере
          помогают новейшие технологии и опыт наших мастеров.
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";

const currentCard = ref({
  title: "Космическая отрасль",
  smallDesc: "",
  txt: "Наша компания специализируется на предоставлении услуг для компаний, разрабатывающих продукцию в аэрокосмической отрасли. Мы предлагаем широкий выбор технологий производства и вариантов материалов, чтобы удовлетворить самые требовательные потребности наших клиентов.",
  color: "#1379fe5e",
});

const cards = [
  {
    title: "Космическая отрасль",
    smallDesc:
      "Мы предлагаем широкий выбор технологий производства для аэрокосмической отрасли...",
    txt: "Наша компания специализируется на предоставлении услуг для компаний, разрабатывающих продукцию в аэрокосмической отрасли. Мы предлагаем широкий выбор технологий производства и вариантов материалов, чтобы удовлетворить самые требовательные потребности наших клиентов.",
    color: "#1379fe5e",
  },
  {
    title: "Автомобильная промышленность",
    smallDesc:
      "Штамповка.РФ помогает эффективно закупать детали для автомобильной промышленности...",
    txt: "Штамповка.РФ — ваш надежный партнер в закупке нестандартных деталей для автомобильной промышленности. Мы предоставляем комплексный сервис для различных производственных процессов, чтобы обеспечить эффективность и качество вашей продукции.",
    color: "#feee135e",
  },
  {
    title: "Электроника и энергетика",
    smallDesc:
      "Мы оптимизируем цепочки поставок для энергетических компаний и ускоряем разработку критически важных компонентов...",
    txt: "Мы помогаем энергетическим компаниям оптимизировать свои цепочки поставок и ускорить разработку критически важных компонентов. Это сокращает время выполнения заказов и способствует созданию более гибкой и оперативно реагирующей производственной экосистемы.",
    color: "#fe4a135e",
  },
  {
    title: "Медицинское оборудование",
    smallDesc:
      "Наш опыт в цифровом производстве помогает компаниям в медицинской промышленности...",
    txt: "Наш широкий спектр производственных технологий и вариантов биосовместимых материалов способствует предоставлению опыта цифрового производства компаниям, разрабатывающим продукцию в медицинской промышленности",
    color: "#56fe135e",
  },
];
</script>

<style lang="scss" scoped>
@import "../fluid.sass";
.wrap-content--activiti {
  justify-content: center;
  @include fluid("gap", 100);
}
.title--activiti {
  display: flex;
  flex-direction: column;
  justify-content: center;
  text-align: left;
  @include fluid("height", 200);
  @include fluid("font-size", 16);
  @include fluid("margin-top", 170);
  h1 {
    @include fluid("font-size", 40);
  }
  h2 {
    @include fluid("font-size", 30);
  }
  p {
    @include fluid("font-size", 20);
  }
}
.img {
  box-shadow: var(--midle-box-x) var(--midle-box-y) 0 0 #b5cbd4;
  @include fluid("width", 490);
  @include fluid("height", 517);
}
@media (max-width: 991px) {
  .title--activiti {
    flex-direction: column;
    @include fluid("gap", 20);
    h1 {
      @include fluid("font-size", 39);
    }
    p {
      @include fluid("font-size", 26);
    }
  }
}
</style>
